Source/system/fvSolution
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  3.0.1                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      fvSolution;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

solvers
{
	p_rgh
	{
		solver          PCG;
		preconditioner	DIC;
		tolerance       1e-09;
		relTol          0.001;
	}

    U
    {
        solver          PBiCGStab;
        preconditioner  DILU;
        tolerance       1e-08;
        relTol          0.0;
    }

	T
	{
		solver          PBiCGStab;
		preconditioner	DILU;
		tolerance       1e-08;
		relTol          0.0;
	}	

}


SIMPLE
{
	nNonOrthogonalCorrectors 0;

	pRefCell 0;
	pRefValue 0;

	residualControl
	{
		p_rgh           1e-6;
		U               1e-6;
		Tf              1e-6;
		Ts              1e-6;
	}

}

relaxationFactors
{
	fields
	{
		p_rgh           0.3;
	}
	equations
	{
		U               0.7;
		T               0.9;
	}
}

// ************************************************************************* //
